[
    {
        "company": "Cross Labs",
        "contract_type": "permanent",
        "position": "Laboratory manager",
        "start_date": "November 2022",
        "end_date": "Present",
        "location": "Kyoto, Japan",
        "website": "https://www.crosslabs.org",
        "summary": "Cross Labs is a research institute, part of [Cross Compass Ltd.](https://www.cross-compass.com/en), which focuses on understanding intelligence from the point of view of Artificial Life (Alife). As a research scientist, my main projects revolved around the themes of *\"Universal Communication\"*: allowing any kind of agents to communicate over any kind of medium; and *\"Perception Augmentation\"*, which started as an exploration on how to augment human capabilities through the use of tools, then expanded into experiential transfer. As a laboratory manager, I was tasked with improving both the physical and virtual space used by other researchers. This includes building and configuring a dedicated server, designing the office's layout, and defining an inventory/storage solution."
    },
    {
        "company": "Altran",
        "contract_type": "permanent",
        "position": "AI Engineer",
        "start_date": "November 2018",
        "end_date": "May 2019",
        "location": "Strasbourg, France",
        "website": "https://www.altran.com/uk/en",
        "summary": "As a member of the Research and Development department, I participated in the creation of a workshop for the Museum called [Le Vaisseau](http://www.levaisseau.com/en/). The aim of the workshop was to introduce children between the age of five and twelve to various concepts in AI. I was put in charge of developing a group activity, whose purpose was to categorize audio clips, consisting in a person mimicking the sound of an object or animal. For example, a child would imitate the sound of a car or a lion, and the system would output a corresponding image. To this end, I implemented a CNN-based classifier using Mel-frequency ceptsrum coefficients as inputs, and trained it on relevant data from [Google's Audioset](https://research.google.com/audioset/). The resulting architecture achieved an 80% accuracy when tested on recording of people mimicking sounds."
    },
    {
        "company": "The University of Sheffield",
        "contract_type": "part-time",
        "position": "Software Engineer",
        "start_date": "October 2015",
        "end_date": "January 2016",
        "location": "Sheffield, the United Kingdom",
        "website": "https://www.sheffield.ac.uk",
        "summary": "Developed material for the laboratory sessions of the 'Machines and Intelligence' (COM1005) module, whose purpose was to introduce the Nao robot and its Pyton API to students."
    },
    {
        "company": "Omnilog SA",
        "contract_type": "permanent",
        "position": "Junior Software Engineer",
        "start_date": "April 2014",
        "end_date": "August 2014",
        "location": "Neully-sur-Seine, France",
        "website": "https://www.omnilog.fr/",
        "summary": "Part of the maintenance team for the French newspaper: [Le Monde](https://www.lemonde.fr/en/?preferred_lang=en), whose mission is to fix any problems within the publication software or the company's website."
    },
    {
        "company": "Artaud, Courthéoux & associés (ACA)",
        "contract_type": "permanent",
        "position": "Junior Software Engineer",
        "start_date": "July 2013",
        "end_date": "February 2014",
        "location": "Paris, France",
        "website": "https://www.aca.fr/?lang=en",
        "summary": "The main mission was the development of a Web Application to manage the customers of an insurance company, along with their different contracts."
    },
    {
        "company": "Cre@tix-web",
        "contract_type": "permanent",
        "position": "Co-founder",
        "start_date": "August 2010",
        "end_date": "February 2014",
        "location": "Paris, France",
        "website": "",
        "summary": "A company, created with Nicolas Ilhe, whose focus was on building website and web-designs. It also provided web hosting services. The purpose of this project was to gain experience in programming, management, and client relationship."
    }
]
